app/channels/application_cable/connection.rb

    def find_verified_user
      if verified_user = User.find_by(session_token: cookies.encrypted[:_pandemonium_session]["session_token"])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "qMwMExbvlHqbsliLCEJMvg"], ["LIMIT", 1]]