app/controllers/api/messages_controller.rb

    def show
        @message = Message.find_by(id: params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @message = Message.find_by(id: params[:id])

        if @message.nil?
            render json: ["Message does not exist."], status: 404
        elsif @message.update(update_params)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "messages" SET "content" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["content", "This is prime time."], ["updated_at", "2021-11-24 01:20:09.330573"], ["id", 3]]

    def create
        @channel = Channel.find_by(id: message_params[:channel_id])
        if @channel.nil?
            render json: ["Channel does not exist"], status: 400
        end
        @message = Message.new(message_params)
        if @message.save
---
INSERT INTO "messages" ("content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I love ice cream"], ["author_id", 3], ["created_at", "2021-11-24 01:43:22.217089"], ["updated_at", "2021-11-24 01:43:22.217089"]]

    def destroy
        @message = Message.find_by(id: params[:id])
        @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 142]]