app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:server_id]
      @users = Server.find(id: :server_id).members
    else
      @users = User.all