app/channels/chat_channel.rb

INSERT INTO "messages" ("content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "try"], ["author_id", 1], ["created_at", "2021-11-27 02:39:37.632910"], ["updated_at", "2021-11-27 02:39:37.632910"]]
---
  def speak(data)
    message = Message.create(content: data['content'], author_id: data['author_id'])